{
  "pages": [
    {
      "text": "This post is a collection of notes of the process I went through to take out systemd for ninit. Pardon for the scarcity, but I'll revisit this with better descriptions.\nWhat IS ninit?\nPreparation\n\nInstall procps-ng-nosystemd\nTemporary symlink to systemd-udevd\nInstall ninit\nSet up service directories. You can find a rough copy (though not perfectly synced) copy of my /etc/ninit dir here\nReboot\n\nPost-install\neudev{,-systemdcompat}\n\nmanually build eudev and eudev-systemdcompat\nRemove the symlink from preparations in systemd\nintall eudev and eudev-systemdcompat\nReboot to test things\n\nnsvc -o {halt,reboot} vs ninit-shutdown -{o,r}\nI recommend ninit-shutdown -{o,r} if you don't want to manually handle turning services off before\ndoing shutdown preparations. ninit-shutdown also assumes quite a few things about how a system should\nbe cleaned up, so if you want more control, you're going to have to create a service to manually shutdown\nthe services you want in the correct order before halting.\nOptional: pretty messages for every section started\n[Edit]: Forgot to fill this section out. Basically, all that's needed for this is a setup file that echos out a simple message.\nDepends aren't really \"depends\" - more like \"start before\"\nTitle says it all. ninit won't actually check if the services that a service depends on have finished executing with success or are running.\nSome ways to work around this include:\n\nSpecify the order daemons are started in like /etc/rc.conf, except with /etc/ninit/daemon/depends: Simple enough work around. \nEverything's also started in parallel like this.\nPatch ninit to include a separate file for services (opt) that specifies true deps that're only run once OR modifies the depends of certain services\nonce it's done running: Too complex, but could be done.\nUse setup, rsetup, or sys-rsetup to do the dependency checking for shared dependencies: One of the things that the ninit docs don't tell you \nis that using nsvc as a synced or waited service is NOT a good idea (nor as a services that's in depends either). I really wouldn't recommend this because this makes things complex.\n\nThoughts\nninit's good enough if you've got a static configuration that doesn't have too many depends that can be easily manually managed. It also doesn't seem to\nkeep track of exit codes for error spotting (since a service could fail, but report back as finished).  However, it'll happily report if something failed\nto run if it was a continuous service. There also isn't much documentation on what the nsvc -L output incicates. I'll try to document these later.\nFor true depends, I'd recommend something else (at least until I can figure out how to patch the run helper in ninit to work around this). \nI'm thinking of maybe also trying out busybox init+(monit or perp), initng, OpenRC, or initscripts-fork. Currently, I'm interested in trying monit \n(even though this'd probably be a little too big for my own needs) since it does this dependency checking on its own and provides some additional \nsecurity features that can be coded (eg: stop running a compromised service). The only thing that scares me about it is that it prefers pid files \ninstead of being a direct parent of the process (as evidenced by with matching|pidfile when asking what to check for a pid). I just need to figure out \nwhich init system to run it from before I \nstart trying it out.\nResources\n\nhttp://www.linuxfromscratch.org/pipermail/blfs-support/2004-March/049009.html\nhttps://github.com/ShadowKyogre/ninit-boot\nhttps://github.com/ShadowKyogre/systemd-unit-converter",
      "loc": "/posts/my-experiences-with-ninit-part-1/",
      "tags": "eudev,ninit,systemd",
      "title": "My Experiences with ninit [Part 1]"
    },
    {
      "text": "It's like the original mikidown, but different. It doesn't have a site generator. Nor does it have whoosh. Or the TOC for the edit window. But it DOES work on Windows. It also uses a QPlainTextEdit in place of a QTextEdit. That's it.",
      "loc": "/mikidown-personal/",
      "tags": "",
      "title": "Mikidown Personal"
    },
    {
      "text": "Took the time the past few days to migrate my Github userpage to be generated by Nikola. Looks kinda bland, buuut, at least I have more control over the theme. I WILL be making it more pretty later. Promise...ish? Be sure to also check the about page for all that juicy bio stuff on me.",
      "loc": "/posts/transferred-github-pages-generator-to-nikola-generated-site/",
      "tags": "github,nikola,oh wow this is really easy,python",
      "title": "Transferred Github Pages generator to Nikola Generated site"
    },
    {
      "text": "Write your page here.\nTodo\n\nCompatibility reports\nLabel each grid line with the date it's associated with\nProbably find a way to integrate matplotlib with this to make this easier?\n\nDependencies\n\nPython 3\nPyQt\n\nInstall\nCopy the files to /usr/share/qbiobeat if you plan to use the *.desktop file included. If not, feel free to leave it where you downloaded it or place it somewhere else.\nLicense\nGPL",
      "loc": "/QBiobeat/",
      "tags": "",
      "title": "QBioBeat"
    },
    {
      "text": "QArithmancy is comprehensive numerology application using PyQt.\nTodo\n\nOther than compatibility numerology stuff, nothing.\n\nDependencies\n\nPython 3\nPyQt\npython-dateutil\n\nInstall\nCopy the files to /usr/share/qarithmancy if you plan to use the *.desktop file included. If not, feel free to leave it where you downloaded it or place it somewhere else.\nLicense\nGPL\nCredits\n\nUses much of the methods documented on Hans Decoz's website. There ARE plans to include alternate calculation methods. I just don't know them.",
      "loc": "/QArithmancy/",
      "tags": "",
      "title": "QArithmancy"
    },
    {
      "text": "ChronosLNX is somewhat of a clone of ChronosXP for Linux systems primarily, although it will work on Windows and Macs, I think. It has most of the basic features of ChronosXP, but it might be missing some.\nIf you have suggestions for lightening up or tidying up the code, visit the Issues page for it and bug me about it.\nTodo\n\nFind an alternate sunrise/sunset method to make this lighter\nFind an alternate moon phase method to make this lighter\nAdd play a sound action to the events\nAlerts for aspects, moon phase, planet in certain sign, etc.\n\nDependencies\n\nPython 3\nPyQt\nPySwisseph\npython-dateutil\n\nInstall\nCopy the files to /usr/share/chronoslnx if you plan to use the *.desktop file included. If not, feel free to leave it where you downloaded it or place it somewhere else. You can also replace the icons for the planets and the program if you want to.\nLicense\nGPL\nCredits\n\nClock script I came across to start off the code\nMinimizing to system tray.\nAnd if it hasn't been said before, ChronosXP.\nOther random sources pasted throughout the code",
      "loc": "/ChronosLNX/",
      "tags": "",
      "title": "ChronosLNX"
    },
    {
      "text": "A little bit about myself\nI'm commonly referred to as Saph or ShadowKyogre, depending on how one first comes across me. Anyway, I started my trek into Linux quite a few years ago with Puppy Linux. After that, I started using PCLinuxOS since looked so similar to Windows XP if configured right. I started hopping between PCLinuxOS, Arch Linux, and Windows XP for a while before finally settling down with Arch.\n\nSo, here I am, using Arch Linux as my primary OS on my desktop, though my laptop still dual boots with Arch Linux and Windows 7.\nHobbies\n\nProgramming\nDrawing\nWriting\nRoleplaying\nPlaying videogames\nOgling random webpages\n\nContact\n\nfreenode IRC Nickname: ShadowKyogre\ndA Username: ShadowKyogre\nAUR/Arch Linux Forums Username: ShadowKyogre\nEmail: shadowkyogre.public@gmail.com\nAIM: ShadowKyogre\nMSN/Skype: Ask\nYahoo: Ask\n\nSome random goodies\n\nMy underwhelming collection of dotfiles\nMy collection of random scripts\nBuildscripts for packages on various distros. Primarily consists of PKGBUILDs and *.specs so far.\nMaaaaad libs\nGimp plugins I've made\nGet some free storage space on Dropbox\nOr get that free space on Copy.com if that's your thing\n\nCompletely original projects\n\nChronosLNX [repo]\nQArithmancy [repo]\nQBioBeat [repo]\nQTarot [repo] (mostly functional, but on pause for GUI deck editor and GUI layout editor)\nInQantation [repo] (stuck on trying to figure out how to structure the DB and whether or not it's redundant with note taking apps other ppl'd use for this sort of thing)\nNCDM [repo]\nA systemd unit converter\nSane ninit boot defaults\n\nStuff that I've forked and maintain regularly\n\nCompiz Boxmenu [repo] (original was Compiz Deskmenu)\nCompiz Standalone Utils [repo] (original was some of the stuff from Openbox that helps with this)\nGTK3 port of Openastro\nMikidown[repo]\n\nStuff that I forked just to make personal tweaks\n\nKeyboard Tiler Python port\nCDM\nDeepin Screenshot\nMikidown (personal copy) [repo]",
      "loc": "/about/",
      "tags": "",
      "title": "Shadowkyogre's Github profile"
    },
    {
      "text": "QTarot is a simple fortune telling app for Linux systems primarily. It works on Windows too. I'm pretty sure it works on Macs. Currently only has the Rider-Waite deck and the Elder Futhark, but more can be added. You can also change the background image for the current reading.\nTodo\n\nMake a GUI editor for deck definitions\nMake a GUI editor for layouts\nMake only the basename for an image in a deck definition matter\nActually fill out the Elder Futhark deck definition\nMore deck themes :|.\nStreamline the GUI for making a new reading with another deck definition\n\nDependencies\n\nPython 3\nPyQt\nlxml\n\nInstall\nCopy the files to /usr/share/qtarot if you plan to use the *.desktop file included. If not, feel free to leave it where you downloaded it or place it somewhere else.\nLicense\nGPL\nCredits\nInspired by http://www.zyqote.com/Linux/pub/tarot/ and http://linux.softpedia.com/get/Education/Qtarot-18925.shtml.\nDefault deck and table also are from here.\nDeck definitions\n\nTeaser deck definitions for the Rider-Waite deck are courtesy of Biddy Tarot. Please check out her page by clicking her name.\n\nLayout sources\n\nhttp://www.tryskelion.com/tryskelion/planetary.htm\nhttp://www.readtarot.com/spreads.html\nhttp://www.learntarot.com/yinyang.htm\n\nStuff I looked up while writing not related to layouts\n\nhttp://standards.freedesktop.org/icon-naming-spec/icon-naming-spec-0.4.html\nhttp://stackoverflow.com/questions/7451183/how-to-create-image-file-from-qgraphicsscene-qgraphicsview\nhttp://www.qtcentre.org/wiki/index.php?title=QGraphicsView:_Smooth_Panning_and_Zooming#Zooming\nhttp://thesmithfam.org/blog/2007/02/03/qt-improving-qgraphicsview-performance/\nhttp://kunalmaemo.blogspot.com/2010/07/rotation-and-mirroring-qgraphicsitem-in.html",
      "loc": "/QTarot/",
      "tags": "",
      "title": "QTarot"
    }
  ]
}